app/Controllers/AdminController.php

SELECT *
FROM `tb_data_energy`
---
   public function index()
{
    $energyModel = new DataEnergyModel();

    $data = [
        'username'    => $this->session->get('username'),
        'energy_data' => $energyModel->findAll(),

SELECT *
FROM `tb_uploads`
---
    public function uploadsList()
    {
        $uploadModel = new UploadModel();

        $data = [
            'username'    => $this->session->get('username'),
            'upload_data' => $uploadModel->findAll()

SELECT *
FROM `tb_data_energy`
WHERE `tb_data_energy`.`id` = '2'
---
     public function edit($id)
    {
        $energyModel = new DataEnergyModel();
        $data = [
            'username' => $this->session->get('username'),
            'data'     => $energyModel->find($id)