app/Controllers/AdminController.php

SELECT *
FROM `tb_data_energy`
ORDER BY `week_label` ASC
SELECT *
FROM `tb_mesin`
---
    public function index()
{
    $energyModel = new DataEnergyModel();
    $mesinModel = new MesinModel();

    $allEnergyData = $energyModel->orderBy('week_label', 'ASC')->findAll();
    $uniqueWeeks = $energyModel->distinct()->findColumn('week_label') ?? [];


    $chartData = [];
    foreach ($allEnergyData as $row) {
        // Pastikan data tidak null
        if ($row['total_produksi'] !== null && $row['energy_kwh'] !== null) {
            // Format yang dibutuhkan Chart.js: {x: ..., y: ...}
            $chartData[] = [
                'x' => (float)$row['total_produksi'],
                'y' => (float)$row['energy_kwh']
            ];
        }
    }

    $data = [
        'username'    => session()->get('username'),
        'list_mesin'  => $mesinModel->findAll(),

SELECT *
FROM `tb_data_energy`
WHERE `week_label` = '2'
---
     public function downloadLaporanMingguan()
    {
        $weekLabel = $this->request->getPost('week_label');
        if (empty($weekLabel)) {
            return redirect()->to('admin/dashboard')->with('error', 'Silakan pilih minggu terlebih dahulu.');
        }

        $energyModel = new DataEnergyModel();
        $listData = $energyModel->where('week_label', $weekLabel)->findAll();

SELECT *
FROM `tb_uploads`
WHERE `tb_uploads`.`id` = '5'
---
     public function processUpload($uploadId)
    {
        $uploadModel = new UploadModel();
        $fileInfo = $uploadModel->find($uploadId);

SELECT *
FROM `tb_uploads`
---
    public function uploadsList()
    {
        $uploadModel = new UploadModel();

        $data = [
            'username'    => $this->session->get('username'),
            'upload_data' => $uploadModel->findAll()