app/Controllers/AuthController.php

    public function processLogin()
{
    // Ambil data dari form
    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');

    // Validasi sederhana
    if (empty($username) || empty($password)) {
        return redirect()->back()->with('error', 'Username dan Password tidak boleh kosong!');
    }

    // Cari user di database
    $userModel = new UserModel();
    $user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `tb_user`
WHERE `username` = 'admin'
 LIMIT 1