app/Controllers/UserController.php

    public function uploadFile()
    {
        $validationRule = [
            'excel_file' => [
                'label' => 'Excel File',
                'rules' => 'uploaded[excel_file]'
                    . '|ext_in[excel_file,xls,xlsx,csv]'
                    . '|max_size[excel_file,5000]', // Maksimal 5MB
            ],
        ];

        if (!$this->validate($validationRule)) {
            // Jika validasi gagal, kembali dengan error
            return redirect()->to('/user/dashboard')->with('error', $this->validator->getErrors()['excel_file']);
        }

        $file = $this->request->getFile('excel_file');
        if ($file->isValid() && !$file->hasMoved()) {
            // Pindahkan file ke folder 'writable/uploads'
            $newName = $file->getRandomName();
            $file->move(WRITEPATH . 'uploads', $newName);

            // Simpan info file ke database
            $uploadModel = new UploadModel();
            $uploadModel->save([
                'filename' => $newName,
                'filepath' => 'writable/uploads/' . $newName,
                'original_name' => $file->getClientName(),
                'uploaded_by' => $this->session->get('user_id'),
            ]);
---
INSERT INTO `tb_uploads` (`filename`, `filepath`, `original_name`, `uploaded_by`) VALUES ('1760516449_00281329a735725fefb4.xlsx', 'writable/uploads/1760516449_00281329a735725fefb4.xlsx', 'data.ccv3.xlsx', '2')